<?php

namespace Modules\SystemSetting\Service;


final class SmsStatusService
{
    private const PREFIX = 'response sms panel sanway : ';

    /** @var array<string,string> */
    private const MESSAGES = [
//        '0'   => 'شناسه پیامک نامعتبر است',
        '1'   => 'هنوز وضعیتی دریافت نشده است',
        '2'   => 'پیامک به موبایل گیرنده رسیده است',
        '3'   => 'پیامک به موبایل گیرنده نرسیده است',
        '4'   => 'پیامک به مرکز مخابراتی رسیده است',
        '5'   => 'پیامک به مرکز مخابراتی نرسیده است',
        '6'   => 'شماره موبایل گیرنده در لیست غیرفعال مخابرات است',
        '7'   => 'پیامک در صف ارسال قرار دارد',
        '8'   => 'سرور در حال ارسال پیامک می باشد',
        '9'   => 'کمبود اعتبار برای ارسال پیامک',
        '10'  => 'پیامک ارسال نشده است (اختلال ارتباطی)',
        '11'  => 'پیامک هنوز توسط اپراتور تأیید نشده است',
        '12'  => 'پیامک در لیست کنسل شده یا فیلتر شده قرار دارد',
        '50'  => 'عملیات موفقیت آمیز بوده است',
        '51'  => 'نام کاربری یا رمز عبور اشتباه است',
        '52'  => 'نام کاربری یا رمز عبور خالی است',
        '53'  => 'طول کلید RecipientNumber بیش از حد مجاز است ( بیش از 1000 عدد است )',
        '54'  => 'کلید RecipientNumber خالی است',
        '55'  => 'کلید RecipientNumber نامعتبر است ( مقدار آن Null است )',
        '56'  => 'طول آرایه MessageID بیش از حد مجاز است ( بیش از 1000 عدد است )',
        '57'  => 'کلید MessageID خالی است',
        '58'  => 'کلید MessageID نامعتبر است ( مقدار آن Null است )',
        '59'  => 'کلید MessageBody خالی است',
        '60'  => 'در حال حاضر به علت ترافیک بالا سرور توانایی پاسخ گویی ندارد ...',
        '61'  => 'کلید SpecialNumber نامعتبر است ( شماره اختصاصی وارد شده وجود ندارد یا متعلق به این کاربر نمی باشد )',
        '62'  => 'کلید SpecialNumber خالی است',
        '77'  => 'شما کاربر وب سرویس نیستید',
        '80'  => 'در حال حاضر وب سرویس توسط Admin غیر فعال شده است ( بعدا برای ارسال پیامک اقدام کنید )',
        '202' => 'اپراتور مخابراتی شماره RecipientNumber برای سیستم ناشناخته است',
        '203' => 'به علت کمبود اعتبار پیام کوتاه شما توانایی ارسال به این شماره را ندارید ( پس از شارژ حساب دوباره ارسال کنید )',
        '205' => 'فرمت شماره PersonNumber اشتباه است',
        '206' => 'شماره اپراتور نامعتبر می باشد',
        '300' => 'ارسال پیامک حاوی لینک مجاز نمی باشد ( توافقنامه ارسال لینک امضا نشده است)',
        '400' => 'تعداد درخواست های ارسالی از حد مجاز در یک فراخوانی سرویس یا بازه زمانی بیشتر است.',
        '666' => 'سرویس موقتاً غیر فعال است',
        '777' => 'این IP مسدود است',
        '888' => 'برای شماره فرستنده احراز هویت ثبت نشده است',
        '999' => 'ارسال این پیامک مجاز نیست',
    ];


    public static function getStatusMessages(array $statusCodes): array | bool
    {
        return array_map(function (string $code) {
            $raw = self::getMessageByCode($code);

            if (! $raw)
                return;

            $message = $raw ?? false;
            return self::PREFIX . $message;
        }, $statusCodes);
    }

    private static function getMessageByCode(string $code): ?string
    {
        return self::MESSAGES[$code] ?? null;
    }
}
